---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.Profile1OffsetY
source: html/862abc02-6757-7899-da5a-ff9c51d73082.htm
---
# Autodesk.Revit.DB.ParameterTypeId.Profile1OffsetY Property

"Vertical Profile Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId Profile1OffsetY { get; }
```